[
  {
    "title": "Maurice Marinot – On Paper, In Glass",
    "main_artist": "Maurice Marinot",
    "other_artists": [],
    "start_date": "2 August 2025",
    "end_date": "25 January 2026",
    "museum": "National Gallery of Ireland",
    "details": "Maurice Marinot (1882–1960) was a French artist renowned for redefining the expressive potential of glassmaking. This in-focus exhibition showcases a selection of his works of art spanning from the 1900s to the 1950s. Marinot infused the intense colours of his earlier paintings into stunning glass objects, including vases, flagons, bowls, and paperweights - earning him the title ‘Le Fauve de Verre (The Wild Beast of Glass).’ The works on display, never before exhibited in the Gallery, along with a range of drawings and glass designs, will reveal his pioneering contribution to the world of glass. The display will also honour the significant gift made to the Gallery by his daughter in the 1970s.",
    "url": "https://www.nationalgallery.ie/art-and-artists/exhibitions/maurice-marinot-paper-glass"
  },
  {
    "title": "AIB Young Portrait Prize 2025",
    "main_artist": null,
    "other_artists": [
      "Rohan Agrawal",
      "Elijah Coada",
      "Abigail Leonard",
      "Victoria Muradova",
      "Darra Murphy",
      "Emilie Cowley Lane",
      "Cillian Rush",
      "Michael Ryan",
      "James Scally",
      "Guorui Sui",
      "Alice Agafonova",
      "Ruixin Chen",
      "Claire Darcy",
      "Samuel Deasy",
      "Jiayi Sun",
      "Matthew Foley",
      "Martha McKeown",
      "Walt Russell",
      "Jill Tritschler",
      "Danny Walsh",
      "Cian O'Brien",
      "Neil-Jack  Hamilton",
      "Alice Rekab"
    ],
    "start_date": "8 November 2025",
    "end_date": "15 March 2026",
    "museum": "National Gallery of Ireland",
    "details": "Running alongside the annual AIB Portrait Prize, the AIB Young Portrait Prize is an inclusive art competition with the aim of fostering and supporting creativity, originality, and self-expression in children and young people. Open to entrants aged 18 and under, of all abilities, from across the island of Ireland, the Prize celebrates emerging young talent in portraiture. Our panel of judges will select 20 finalists across four age categories. These artworks will be featured in an exhibition in the Portrait Gallery from 8 November 2025 - 15 March 2026.",
    "url": "https://www.nationalgallery.ie/art-and-artists/exhibitions/upcoming-exhibitions/aib-young-portrait-prize-2025"
  },
  {
    "title": "AIB Portrait Prize 2026",
    "main_artist": null,
    "other_artists": [
      "Dr Brendan Rooney",
      "William Blake",
      "Hilma af Klint",
      "Jan Steen",
      "Turner",
      "Rembrandt",
      "Matisse"
    ],
    "start_date": "14 November 2026",
    "end_date": "14 March 2027",
    "museum": "National Gallery of Ireland",
    "details": "The annual AIB Portrait Prize returns in 2026, once again celebrating contemporary portraiture by Irish artists from Ireland and abroad. A shortlist of works will be selected by an expert judging panel, with the winning artist receiving a €15,000 prize and a €5,000 commission for inclusion in the National Portrait Collection. The winner will be announced at a ceremony in November 2026. The competition culminates in an exhibition in the Portrait Gallery.",
    "url": "https://www.nationalgallery.ie/art-and-artists/exhibitions/upcoming-exhibitions/aib-portrait-prize-2026"
  }
]